[{"data":1,"prerenderedAt":108},["ShallowReactive",2],{"posts":3},[4],{"_path":5,"_dir":6,"_draft":7,"_partial":7,"_locale":8,"title":9,"description":10,"image":11,"date":12,"slug":13,"body":14,"_type":102,"_id":103,"_source":104,"_file":105,"_stem":106,"_extension":107},"/media-center/metropolitan-electric-delivers-ev-buses-to-bank-of-industry","media-center",false,"","Metropolitan Electric Limited Delivers a Fleet of Electric Buses to the Bank of Industry","Metropolitan Electric Limited, a leading electric vehicle manufacturer, has successfully delivered a fleet of electric buses, advancing Sustainable Mobility in Nigeria","https://utfs.io/f/3VcV2KI5zmFpOcuKWNy9z1hrGfodksTLgApeIXyCRMKxwJiZ","October 14, 2024","metropolitan-electric-delivers-ev-buses-to-bank-of-industry",{"type":15,"children":16,"toc":99},"root",[17,25,30,35,44,59,64,76,81,86,94],{"type":18,"tag":19,"props":20,"children":21},"element","p",{},[22],{"type":23,"value":24},"text","In a significant step towards promoting sustainable mobility across Nigeria, Metropolitan Electric Limited, a leader in electric vehicle (EV) solutions, has successfully delivered a fleet of energy-efficient buses to the Bank of Industry (BOI). This marks a milestone in Metropolitan Electric’s mission to revolutionize transportation through cutting-edge technology and sustainable solutions tailored to meet the needs of the African market.",{"type":18,"tag":19,"props":26,"children":27},{},[28],{"type":23,"value":29},"The commissioning event at the BOI headquarters in Lagos, carried out by the Managing Director of BOI, Mr. Olasupo Olusi, saw Metropolitan Electric Limited represented by Mr. Femi Agunbiade, Director at Metropolitan Electric, and Mr. Koye Tejuoso, Chief Operations Officer. Both executives reaffirmed the company’s commitment to driving the adoption of electric and energy-efficient vehicles across Nigeria, paving the way for an eco-friendly future in transportation.",{"type":18,"tag":19,"props":31,"children":32},{},[33],{"type":23,"value":34},"At the event, Mr. Koye Tejuoso, COO of Metropolitan Electric Limited, said:",{"type":18,"tag":36,"props":37,"children":38},"blockquote",{},[39],{"type":18,"tag":19,"props":40,"children":41},{},[42],{"type":23,"value":43},"\"This partnership with the Bank of Industry exemplifies our commitment to delivering sustainable mobility solutions across Africa. By providing this fleet of buses, we are taking concrete steps toward reducing the carbon footprint of Nigeria’s transport sector while enhancing the efficiency of operations at BOI.\"",{"type":18,"tag":19,"props":45,"children":46},{},[47,54],{"type":18,"tag":48,"props":49,"children":53},"img",{"alt":9,"className":50,"src":52},[51],"w-full","https://utfs.io/f/3VcV2KI5zmFpSjLdMRruzCJ8psB7v4MOYXomiyIbtTdQn9Zr",[],{"type":18,"tag":48,"props":55,"children":58},{"alt":9,"className":56,"src":57},[51],"https://utfs.io/f/3VcV2KI5zmFp61iEAa3XCTs2yNM35wcUnzDgS0eah7vGxrtB",[],{"type":18,"tag":19,"props":60,"children":61},{},[62],{"type":23,"value":63},"The buses delivered to the Bank of Industry are equipped with modern electric motors that run on electricity, producing zero tailpipe emissions. This decision reflects the Bank’s commitment to enhancing staff mobility while actively contributing to climate change mitigation and promoting sustainability through cleaner transportation solutions.",{"type":18,"tag":19,"props":65,"children":66},{},[67,74],{"type":18,"tag":68,"props":69,"children":71},"a",{"href":70},"/#services",[72],{"type":23,"value":73},"Learn more about our sustainable mobility initiatives here",{"type":23,"value":75},".",{"type":18,"tag":19,"props":77,"children":78},{},[79],{"type":23,"value":80},"This initiative is vital to Metropolitan Electric Limited’s broader vision of promoting electric vehicles and energy-efficient transport solutions across the continent as the company leads the way in the EV revolution across Africa.",{"type":18,"tag":19,"props":82,"children":83},{},[84],{"type":23,"value":85},"Mr. Femi Agunbiade, Director of Metropolitan Electric Limited, also noted:",{"type":18,"tag":36,"props":87,"children":88},{},[89],{"type":18,"tag":19,"props":90,"children":91},{},[92],{"type":23,"value":93},"\"As trailblazers in the electric vehicle industry in Africa, we are proud to collaborate with progressive institutions like the Bank of Industry. We aim to continually innovate and offer solutions that make electric and energy-efficient transportation accessible, reliable, and impactful across Nigeria and beyond.\"",{"type":18,"tag":19,"props":95,"children":96},{},[97],{"type":23,"value":98},"With its roots in Nigeria, Metropolitan Electric Limited continues to lead the transition toward electric mobility, focusing on providing solutions that are not only sustainable but also economically viable for African businesses and governments. As part of this strategy, the company seeks to collaborate with more regional stakeholders, including private enterprises and public institutions, to drive the widespread adoption of electric vehicles and sustainable mobility solutions.",{"title":8,"searchDepth":100,"depth":100,"links":101},2,[],"markdown","content:media-center:metropolitan-electric-delivers-ev-buses-to-bank-of-industry.md","content","media-center/metropolitan-electric-delivers-ev-buses-to-bank-of-industry.md","media-center/metropolitan-electric-delivers-ev-buses-to-bank-of-industry","md",1729858094276]